Service - Intermediation/sample messages/RetrieveClient-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header>
      <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Intermediation/Intermediation/RetrieveClient</wsa:Action>
   </soap:Header>
   <soap:Body>
      <int:RetrieveClient xmlns:int="https://services.ird.govt.nz/GWS/Intermediation/">
         <int:RetrieveClientRequestMsg>
            <ret:RetrieveClientRequestWrapper xmlns:ret="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientRequest">
               <int1:retrieveClientRequest xmlns:int1="urn:www.ird.govt.nz/GWS:types/Intermediation.v1">
                  <com:softwareProviderData xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2">
                     <com:softwareProvider>softwareProvider</com:softwareProvider>
                     <com:softwarePlatform>softwarePlatform</com:softwarePlatform>
                     <com:softwareRelease>1.0</com:softwareRelease>
                  </com:softwareProviderData>
                  <com:identifier xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2" IdentifierValueType="IRD">132261132</com:identifier>
                  <int1:client>
                     <int1:clientID IdentifierValueType="ACCIRD">077415807</int1:clientID>
                     <int1:clientAccountType>EMP</int1:clientAccountType>
                  </int1:client>
               </int1:retrieveClientRequest>
            </ret:RetrieveClientRequestWrapper>
         </int:RetrieveClientRequestMsg>
      </int:RetrieveClient>
   </soap:Body>
</soap:Envelope>